python, numpy, pandas 날짜 타입 비교 및 정리

- datetime은 python 설치 시 기본적으로 내장된 라이브러리로, 날짜를 쓸 것인지, 시간을 쓸 것인지, 날짜시간을 합쳐쓸 것인지에 따라 클래스가 분화되어 있는 것이 특징. 예를들어 '2021-3-16'을 표시하고 싶으면 date 클래스를 사용하고, '2021-3-16 12:34:21'를 표시하고 싶으면 'datetime' 클래스를 사용합니다. 
- 반면 datetime64나 Timestamp는 각각 numpy, pandas 라이브러리에서 새로 정의한 날짜시간 클래스입니다. 이 둘은 numpy, pandas를 설치해야만 이용할 수 있고, 한 클래스로 날짜, 시간, 날짜시간을 모두 정의할 수 있는 것이 특징
- 날짜, 시간 타입은 일반적인 정수, 실수끼리 연산할 때와 달리 단위를 가지고 있는 점 때문에 시간의 차이를 저장하는 별도의 클래스가 있다는 특징. 이를 timedelta(타임델타)라고 하는데, 날짜, 시간은 특정 시점의 시각을 표시하는 용도이고(2021년 3월 16일), 타임델타는 기간 또는 시간 차이를 표시하는 용도(5일)

- https://ellun.tistory.com/320

<img src='dataset/날짜타입.jpg' STYLE='width:500px;'>

파이썬 datetime 모듈
- 기본 개념: datetime 모듈은 날짜 및 시간을 다루는 기본적인 클래스들(date, time, datetime, timedelta, tzinfo)을 제공
- 날짜 생성 및 조작: 특정 날짜를 생성하거나 날짜 간의 차이를 계산하는 등의 기능을 수행
- 포맷팅: strftime()을 사용하여 날짜를 문자열로, strptime()을 사용하여 문자열을 날짜로 변환
- 시간대 처리: 시간대를 처리하는 기능을 포함하고 있지만, 별도의 라이브러리(pytz 등)의 도움이 필요

판다스
- 시계열 데이터 처리에 최적화: 판다스는 시계열 데이터 처리에 특화되어 있으며, 대량의 날짜 데이터를 빠르고 효율적으로 처리할 수 있다.
- DateTimeIndex: 판다스는 DateTimeIndex를 제공하여 시계열 데이터의 인덱싱과 슬라이싱을 간편하게 한다.
- 시간대 처리: 판다스는 내장된 시간대 처리 기능을 제공하며, 시간대 변환을 손쉽게 할 수 있다.
- 날짜 데이터 변환 및 조작: to_datetime() 함수로 다양한 형식의 날짜 문자열을 datetime 객체로 변환할 수 있다. 또한, resample, asfreq 등의 메서드로 시계열 데이터의 빈도를 변경하는 등 다양한 날짜 관련 조작을 지원.
- 통합된 데이터 처리: 판다스는 DataFrame이나 Series 내의 날짜 데이터를 다룰 때, 다른 데이터 유형과의 통합된 처리가 가능.

포인트
- 파이썬 datetime: 날짜 및 시간의 기본적인 처리에 적합하며, 작고 단순한 날짜 관련 작업에 이상적이다.
- 판다스: 대규모 데이터셋에서 복잡하고 고급 시계열 데이터 처리에 적합하며, 데이터 분석과 관련된 다양한 기능을 제공한다.
- 사용 사례에 따라 적절한 도구를 선택하는 것이 중요. 작은 규모의 기본적인 날짜 연산에는 datetime을, 복잡한 데이터셋과 시계열 분석에는 판다스를 사용하는 것이 일반적.

Python의 datetime 모듈을 사용한 날짜 처리 예시. 이 예제들은 datetime 모듈을 사용하여 날짜 및 시간 데이터를 다루는 기본적인 방법을 보여준다.

- 현재 날짜 및 시간 얻기: datetime.now()를 사용.
- 특정 날짜 및 시간 생성: datetime 객체를 직접 생성.
- 날짜 간 차이 계산: timedelta를 사용.
- 날짜 포맷팅: 날짜를 문자열로 변환하거나 문자열로부터 날짜를 파싱.
- 날짜와 시간 요소 접근: 날짜의 연도, 월, 일 등을 접근.

판다스를 사용한 날짜 처리의 예. 이 예제들은 판다스가 시계열 데이터를 어떻게 다룰 수 있는지 보여준다.

- 날짜 범위 생성: pd.date_range()를 사용하여 날짜 범위를 생성.
- 날짜 변환: 문자열을 pd.to_datetime()을 사용하여 날짜 객체로 변환.
- 시계열 데이터 생성: 날짜를 인덱스로 사용하는 시계열 데이터를 생성.
- 날짜 기반 필터링: 특정 날짜 조건을 만족하는 데이터를 필터링.
- 시계열 데이터 리샘플링: 월별 평균 등으로 데이터를 리샘플링.
- 이 코드를 실행하면, 판다스를 사용하여 날짜 데이터를 다양하게 처리하는 방법을 확인할 수 있다. 날짜 범위 생성, 날짜 변환, 시계열 데이터 처리 등은 데이터 분석에서 매우 유용하게 활용.

In [2]:
from datetime import datetime, timedelta
now = datetime.now()  # 현재 시각
yesterday = now - timedelta(days=1)  # 어제 날짜
yesterday

datetime.datetime(2023, 11, 29, 9, 55, 26, 578170)

In [9]:
import pandas as pd
date_range = pd.date_range(start='2020-01-01', end='2020-01-10')
date_range

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10'],
              dtype='datetime64[ns]', freq='D')

In [10]:
# 날짜 범위 생성
date_range = pd.date_range(start='2020-01-01', end='2020-01-10')

print("날짜 범위:", date_range)

날짜 범위: DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# 날짜 변환
dates = ['2020-01-01', '2020-01-05', '2020-01-10']
date_objects = pd.to_datetime(dates)
print("날짜 객체:", date_objects)

날짜 객체: DatetimeIndex(['2020-01-01', '2020-01-05', '2020-01-10'], dtype='datetime64[ns]', freq=None)

In [16]:
# 시계열 데이터 생성
data = pd.Series([1, 2, 3], index=pd.to_datetime(['2020-01-01', '2020-01-02', '2020-01-03']))
print("시계열 데이터:", data)

시계열 데이터: 2020-01-01    1
2020-01-02    2
2020-01-03    3
dtype: int64

In [14]:
# 날짜 기반 필터링
filtered_data = data['2020-01-01':'2020-01-03']
print("필터링된 데이터:", filtered_data)

필터링된 데이터: 2020-01-01    1
2020-01-02    2
2020-01-03    3
dtype: int64

In [15]:
# 시계열 데이터 리샘플링, 월별 평균
resampled_data = data.resample('M').mean()
print("리샘플링된 데이터:", resampled_data)

리샘플링된 데이터: 2020-01-31    2.0
Freq: M, dtype: float64

In [4]:
import pandas as pd

# 날짜 범위 생성
date_range = pd.date_range(start='2020-01-01', end='2020-01-10')

# 날짜 변환
dates = ['2020-01-01', '2020-01-05', '2020-01-10']
date_objects = pd.to_datetime(dates)

# 시계열 데이터 생성
data = pd.Series([1, 2, 3], index=pd.to_datetime(['2020-01-01', '2020-01-02', '2020-01-03']))

# 날짜 기반 필터링
filtered_data = data['2020-01-01':'2020-01-02']

# 시계열 데이터 리샘플링
resampled_data = data.resample('M').mean()

print("날짜 범위:", date_range)
print("날짜 객체:", date_objects)
print("시계열 데이터:", data)
print("필터링된 데이터:", filtered_data)
print("리샘플링된 데이터:", resampled_data)

날짜 범위: DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10'],
              dtype='datetime64[ns]', freq='D')
날짜 객체: DatetimeIndex(['2020-01-01', '2020-01-05', '2020-01-10'], dtype='datetime64[ns]', freq=None)
시계열 데이터: 2020-01-01    1
2020-01-02    2
2020-01-03    3
dtype: int64
필터링된 데이터: 2020-01-01    1
2020-01-02    2
dtype: int64
리샘플링된 데이터: 2020-01-31    2.0
Freq: M, dtype: float64

In [7]:
from datetime import datetime, timedelta

# 현재 날짜 및 시간
now = datetime.now()
# 특정 날짜 및 시간 생성
specific_date = datetime(2020, 1, 1, 10, 30)

print("현재 날짜 및 시간:", now)
print("특정 날짜 및 시간:", specific_date,type(specific_date))

현재 날짜 및 시간: 2023-11-30 11:29:25.202088
특정 날짜 및 시간: 2020-01-01 10:30:00 <class 'datetime.datetime'>

In [8]:
# 날짜 포맷팅
formatted_date = now.strftime("%Y-%m-%d %H:%M:%S")
parsed_date = datetime.strptime("2020-01-01", "%Y-%m-%d")
print("포맷된 날짜:", formatted_date)
print("파싱된 날짜:", parsed_date)

포맷된 날짜: 2023-11-30 11:29:25
파싱된 날짜: 2020-01-01 00:00:00

In [5]:
from datetime import datetime, timedelta

# 현재 날짜 및 시간
now = datetime.now()

# 특정 날짜 및 시간 생성
specific_date = datetime(2020, 1, 1, 10, 30)

# 날짜 간 차이 계산
delta = now - specific_date

# 날짜 포맷팅
formatted_date = now.strftime("%Y-%m-%d %H:%M:%S")
parsed_date = datetime.strptime("2020-01-01", "%Y-%m-%d")

# 날짜와 시간 요소 접근
year = now.year
month = now.month
day = now.day

print("현재 날짜 및 시간:", now)
print("특정 날짜 및 시간:", specific_date)
print("날짜 간 차이:", delta)
print("포맷된 날짜:", formatted_date)
print("파싱된 날짜:", parsed_date)
print("년:", year, "월:", month, "일:", day)

현재 날짜 및 시간: 2023-11-30 10:01:05.448387
특정 날짜 및 시간: 2020-01-01 10:30:00
날짜 간 차이: 1428 days, 23:31:05.448387
포맷된 날짜: 2023-11-30 10:01:05
파싱된 날짜: 2020-01-01 00:00:00
년: 2023 월: 11 일: 30

## 파이썬 날짜, 시간

In [ ]:
# timestamp -> str
import time

t = time.time()
print(t, type(t))
s = str(time.time())
print(s,type(s))

1656488601.817889 <class 'float'>
1656488601.817889 <class 'str'>

In [ ]:
# datetime - > str
from datetime import datetime
s = datetime.now()
print(s,type(s))

s1 = s.strftime('%Y-%m-%d %H:%M:%S')
print(s1,type(s1))

2022-06-29 16:45:18.845439 <class 'datetime.datetime'>
2022-06-29 16:45:18 <class 'str'>

In [ ]:
# str -> datetime
from datetime import datetime
s = '2021-07-20 11:13:58'
print(s,type(s))
d = datetime.strptime(s,'%Y-%m-%d %H:%M:%S')
print(d,type(d))

2021-07-20 11:13:58 <class 'str'>
2021-07-20 11:13:58 <class 'datetime.datetime'>

In [ ]:
# str -> datetime -> timestamp
s = '2021-07-20 11:13:58'
timestamp = time.mktime(datetime.strptime(s,'%Y-%m-%d %H:%M:%S').timetuple())
print(timestamp,type(timestamp))

1626747238.0 <class 'float'>

In [ ]:
# datetime -> timestamp
d = datetime.today()
print(d,type(d))
timestamp = time.mktime(d.timetuple())
print(timestamp, type(timestamp))

2022-06-29 16:56:10.197271 <class 'datetime.datetime'>
1656489370.0 <class 'float'>

In [ ]:
# timestamp -> datetime
t = time.time()
print(t,type(t))
d = datetime.fromtimestamp(t)
print(d,type(d))

1656489426.2012503 <class 'float'>
2022-06-29 16:57:06.201250 <class 'datetime.datetime'>

In [ ]:
# 1년전 datetime 값
from datetime import timedelta
import time

datetime_now = datetime.now()
delta_datetime = timedelta(days=-365)
print(delta_datetime)
datetime_now + delta_datetime

-365 days, 0:00:00

datetime.datetime(2021, 6, 29, 16, 50, 47, 774629)

In [ ]:
# 두 날짜간의 일수 구하기
since_timestamp = datetime.strptime('20180301','%Y%m%d')
until_timestamp = datetime.strptime('20180331','%Y%m%d')
print(since_timestamp)
print(until_timestamp)
result = until_timestamp - since_timestamp
result

2018-03-01 00:00:00
2018-03-31 00:00:00

datetime.timedelta(days=30)

In [ ]:
# 특정일 구하기
import datetime
def get_yoil(y,m,d):
    days = ['MON','TUE','WED','THU','FRI','SAT','SUN']
    return days[datetime.date(y,m,d).weekday()]
get_yoil(2021,7,20)

'TUE'

Pandas로 날짜를 다루는 방법은 크게 3가지로 나눌 수 있습니다.

- 날짜 생성하기
- 날짜 범위 생성하기
- 날짜 데이터 다루기

In [ ]:
import pandas as pd

date = pd.to_datetime('2022-04-02')
print(date)

2022-04-02 00:00:00

In [ ]:
import pandas as pd

dates = pd.date_range(start='2022-01-01', end='2022-12-31')
print(dates)

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10',
               ...
               '2022-12-22', '2022-12-23', '2022-12-24', '2022-12-25',
               '2022-12-26', '2022-12-27', '2022-12-28', '2022-12-29',
               '2022-12-30', '2022-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [ ]:
import pandas as pd

df = pd.DataFrame({'date': ['2022-01-01', '2022-01-02', '2022-01-03'], 'value': [1, 2, 3]})
df['date'] = pd.to_datetime(df['date'])
print(df)

        date  value
0 2022-01-01      1
1 2022-01-02      2
2 2022-01-03      3

In [ ]:
# 판다스 to_datetime
pd.to_datetime(1626751238.7134328,unit='s')

Timestamp('2021-07-20 03:20:38.713432832')

In [1]:
import pandas as pd
date = pd.Timestamp(1626747931.0,unit='s',tz='Asia/Seoul')
print(date,type(date))

2021-07-20 11:25:31+09:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [29]:
df = pd.read_csv('dataset/stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [31]:
df['New_Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   New_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [32]:
df.drop('Date',axis=1,inplace=True)
df['year'] = df['New_Date'].dt.year
df['month'] = df['New_Date'].dt.month
df['day'] = df['New_Date'].dt.day
df.head()

   Close  Start   High    Low  Volume   New_Date  year  month  day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [20]:
df.set_index('New_Date',inplace=True)
df.head()

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [23]:
df.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='New_Date', freq=None)

In [25]:
df.sort_index(inplace=True)

In [26]:
df_ymd_range = df.loc['2018-06-26':'2018-06-29']
df_ymd_range

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-06-26  10800  10900  11000  10700   63039  2018      6   26
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-29  10700  10550  10900   9990  170253  2018      6   29

In [ ]:
df_ymd_range = df['2018-06-26':'2018-06-29']
df_ymd_range

Empty DataFrame
Columns: [Close, Start, High, Low, Volume, year, month, day]
Index: []

In [27]:
df_ym = df.loc['2018-07','Start':'High']
df_ym

            Start   High
New_Date
2018-07-02  10850  10900

In [33]:
import numpy as np
import pandas as pd
# Time Series Basics
from datetime import datetime
dates = [datetime(2011,1,2),datetime(2011,1,5),
        datetime(2011,1,7),datetime(2011,1,8),
        datetime(2011,1,10),datetime(2011,1,12)]
ts = pd.Series(np.random.randn(6),index=dates)
ts

2011-01-02    1.618404
2011-01-05    0.345564
2011-01-07    0.039843
2011-01-08   -0.570340
2011-01-10    0.694781
2011-01-12    1.193087
dtype: float64

In [34]:
df = pd.DataFrame(ts, columns=['Value'])
df

               Value
2011-01-02  1.618404
2011-01-05  0.345564
2011-01-07  0.039843
2011-01-08 -0.570340
2011-01-10  0.694781
2011-01-12  1.193087

In [ ]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [ ]:
ts[::2]

2011-01-02   -1.002346
2011-01-07   -0.546466
2011-01-10    1.089753
dtype: float64

In [ ]:
ts + ts[::2]

2011-01-02   -2.004692
2011-01-05         NaN
2011-01-07   -1.092931
2011-01-08         NaN
2011-01-10    2.179506
2011-01-12         NaN
dtype: float64

In [ ]:
ts.index[0]

Timestamp('2011-01-02 00:00:00')

In [ ]:
# Indexing, Selection, Subsetting
stamp = ts.index[2]
ts[stamp]

-0.546465516485552

In [ ]:
# 2011-01-10    1.089753
print(ts['1/10/2011'])
ts['20110110']

1.0897528460611405

1.0897528460611405

In [44]:
longer_ts = pd.Series(np.random.randn(365),
                     index=pd.date_range('11/30/2023',periods=365))
longer_ts

2023-11-30   -0.427358
2023-12-01    0.402901
2023-12-02   -1.049575
2023-12-03    0.235870
2023-12-04    0.610310
                ...
2024-11-24    0.713598
2024-11-25   -0.062502
2024-11-26   -1.544462
2024-11-27   -0.389514
2024-11-28   -0.096690
Freq: D, Length: 365, dtype: float64

In [ ]:
longer_ts = pd.Series(np.random.randn(1000),
                     index=pd.date_range('1/1/2000',periods=1000))
print(longer_ts,'\n')

2000-01-01    1.474694
2000-01-02   -0.770918
2000-01-03    1.693368
2000-01-04    0.757829
2000-01-05    0.790624
                ...
2002-09-22    0.324149
2002-09-23   -1.073186
2002-09-24   -0.712718
2002-09-25    1.311645
2002-09-26   -0.358281
Freq: D, Length: 1000, dtype: float64

In [ ]:
longer_ts['2001-05'][:5]

2001-05-01   -0.634009
2001-05-02   -1.047831
2001-05-03    1.994927
2001-05-04    0.473721
2001-05-05   -0.125936
Freq: D, dtype: float64

In [ ]:
ts[datetime(2011,1,7):]

2011-01-07   -0.546466
2011-01-08    0.230811
2011-01-10    1.089753
2011-01-12   -0.642663
dtype: float64

In [ ]:
ts

2011-01-02   -1.002346
2011-01-05   -1.015073
2011-01-07   -0.546466
2011-01-08    0.230811
2011-01-10    1.089753
2011-01-12   -0.642663
dtype: float64

In [ ]:
# truncate
print(ts.truncate(before='2011-01-05',after='2011-01-10'))

2011-01-05   -1.015073
2011-01-07   -0.546466
2011-01-08    0.230811
2011-01-10    1.089753
dtype: float64

In [ ]:
print(ts.truncate(after='1/9/2011'))

2011-01-02   -1.002346
2011-01-05   -1.015073
2011-01-07   -0.546466
2011-01-08    0.230811
dtype: float64

In [ ]:
pd.date_range('2020-10-7','2020-10-20')

DatetimeIndex(['2020-10-07', '2020-10-08', '2020-10-09', '2020-10-10',
               '2020-10-11', '2020-10-12', '2020-10-13', '2020-10-14',
               '2020-10-15', '2020-10-16', '2020-10-17', '2020-10-18',
               '2020-10-19', '2020-10-20'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
from datetime import datetime
from datetime import timedelta

now = datetime.now()
in_two_weeks=now+timedelta(weeks=2)
pd.date_range(datetime.now(),in_two_weeks)

DatetimeIndex(['2021-07-20 14:11:52.963651', '2021-07-21 14:11:52.963651',
               '2021-07-22 14:11:52.963651', '2021-07-23 14:11:52.963651',
               '2021-07-24 14:11:52.963651', '2021-07-25 14:11:52.963651',
               '2021-07-26 14:11:52.963651', '2021-07-27 14:11:52.963651',
               '2021-07-28 14:11:52.963651', '2021-07-29 14:11:52.963651',
               '2021-07-30 14:11:52.963651', '2021-07-31 14:11:52.963651',
               '2021-08-01 14:11:52.963651', '2021-08-02 14:11:52.963651',
               '2021-08-03 14:11:52.963651'],
              dtype='datetime64[ns]', freq='D')

In [39]:
# periods 매개변수는 date_range 함수에 전달된 시작날짜와 종료날짜를
# periods 매개변수에 전달된 기준의 수만큼 동일하게 나누어 출력
ts = pd.date_range(start='2023-11-01',end='2023-11-30',periods=30)
ts

DatetimeIndex(['2023-11-01', '2023-11-02', '2023-11-03', '2023-11-04',
               '2023-11-05', '2023-11-06', '2023-11-07', '2023-11-08',
               '2023-11-09', '2023-11-10', '2023-11-11', '2023-11-12',
               '2023-11-13', '2023-11-14', '2023-11-15', '2023-11-16',
               '2023-11-17', '2023-11-18', '2023-11-19', '2023-11-20',
               '2023-11-21', '2023-11-22', '2023-11-23', '2023-11-24',
               '2023-11-25', '2023-11-26', '2023-11-27', '2023-11-28',
               '2023-11-29', '2023-11-30'],
              dtype='datetime64[ns]', freq=None)

In [42]:
df = pd.DataFrame(np.arange(30), index=ts, columns=['value'])
df

            value
2023-11-01      0
2023-11-02      1
2023-11-03      2
2023-11-04      3
2023-11-05      4
2023-11-06      5
2023-11-07      6
2023-11-08      7
2023-11-09      8
2023-11-10      9
2023-11-11     10
2023-11-12     11
2023-11-13     12
2023-11-14     13
2023-11-15     14
2023-11-16     15
2023-11-17     16
2023-11-18     17
2023-11-19     18
2023-11-20     19
2023-11-21     20
2023-11-22     21
2023-11-23     22
2023-11-24     23
2023-11-25     24
2023-11-26     25
2023-11-27     26
2023-11-28     27
2023-11-29     28
2023-11-30     29

In [ ]:
pd.date_range('2012-05-02 12:56:31', periods=5, normalize=True)

DatetimeIndex(['2012-05-02', '2012-05-03', '2012-05-04', '2012-05-05',
               '2012-05-06'],
              dtype='datetime64[ns]', freq='D')

freq 매개변수에 사용되는 Frequncy strings
- A calendar year end frequency
- B	business day frequency
- C	custom business day frequency
- D	calendar day frequency
- W	weekly frequency
- M	month end frequency
- SM	semi-month end frequency (15th and end of month)
- BM	business month end frequency
- CBM	custom business month end frequency
- MS	month start frequency
- SMS	semi-month start frequency (1st and 15th)
- BMS	business month start frequency
- CBMS	custom business month start frequency
- Q	quarter end frequency

In [45]:
import numpy as np
dates = pd.date_range('11/30/2023', periods=10, freq='W-WED')
print(dates)

DatetimeIndex(['2023-12-06', '2023-12-13', '2023-12-20', '2023-12-27',
               '2024-01-03', '2024-01-10', '2024-01-17', '2024-01-24',
               '2024-01-31', '2024-02-07'],
              dtype='datetime64[ns]', freq='W-WED')

In [47]:
np.random.randint(3, size=10)

array([1, 0, 0, 2, 1, 1, 2, 2, 2, 0])

In [49]:
df = pd.DataFrame(np.random.randint(3, size=10), index=dates, columns=['운동시간'])
df

            운동시간
2023-12-06     2
2023-12-13     0
2023-12-20     1
2023-12-27     1
2024-01-03     2
2024-01-10     1
2024-01-17     2
2024-01-24     2
2024-01-31     0
2024-02-07     1

In [ ]:
long_df = pd.DataFrame(np.random.randn(100,4),
                      index=dates,
                      columns = ['Colorado','Texas','New York','Ohio'])
print(long_df,'\n')
long_df.loc['2001-06']

            Colorado     Texas  New York      Ohio
2000-01-05 -0.441085  1.287963 -0.060799  0.109101
2000-01-12 -0.298944 -0.874732 -0.625747 -0.549979
2000-01-19  0.675000  1.330668 -0.681337  1.098610
2000-01-26  0.452010  0.024461 -1.038523  0.571128
2000-02-02  1.286345 -0.768212 -0.953816 -0.353519
...              ...       ...       ...       ...
2001-10-31 -0.006981  1.291081 -0.696848 -0.400194
2001-11-07  1.316462 -0.515380  0.480864  1.325687
2001-11-14 -0.214950  0.188236  0.788619  0.368392
2001-11-21  1.345041  0.039718  0.682622  0.906851
2001-11-28 -0.898369 -0.227789 -0.923387 -1.028037

[100 rows x 4 columns]

            Colorado     Texas  New York      Ohio
2001-06-06  0.473579 -0.443727  0.040771 -0.355599
2001-06-13 -0.038756 -1.221942 -1.098992 -0.815568
2001-06-20  0.637949 -1.487480 -0.288095 -1.192054
2001-06-27  0.828341 -0.117620  2.210951  0.524021

In [ ]:
dates = pd.DatetimeIndex(['1/1/2000','1/2/2000','1/2/2000','1/2/2000',
                         '1/3/2000'])
dup_ts = pd.Series(np.arange(5),index=dates)
dup_ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int32

In [ ]:
dup_ts.index.is_unique

False

In [ ]:
dup_ts['1/3/2000'] # not duplicated의 경우 스칼라 값

4

In [ ]:
dup_ts['1/2/2000'] # duplicated의 경우 슬라이스 출력

2000-01-02    1
2000-01-02    2
2000-01-02    3
dtype: int32

In [ ]:
grouped = dup_ts.groupby(level=0)
print(grouped.mean())
grouped.count()

2000-01-01    0
2000-01-02    2
2000-01-03    4
dtype: int32

2000-01-01    1
2000-01-02    3
2000-01-03    1
dtype: int64

In [ ]:
pd.date_range('2000-01-01','2000-01-03 23:59',freq='4h')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

In [ ]:
from pandas.tseries.offsets import Hour, Minute
Hour(2) + Minute(30)

In [ ]:
pd.date_range('2000-01-01', periods=10, freq='1h30min')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 01:30:00',
               '2000-01-01 03:00:00', '2000-01-01 04:30:00',
               '2000-01-01 06:00:00', '2000-01-01 07:30:00',
               '2000-01-01 09:00:00', '2000-01-01 10:30:00',
               '2000-01-01 12:00:00', '2000-01-01 13:30:00'],
              dtype='datetime64[ns]', freq='90T')

In [ ]:
rng = pd.date_range('2000-01-01','2012-09-01',freq='WOM-3FRI')
print(rng)

DatetimeIndex(['2000-01-21', '2000-02-18', '2000-03-17', '2000-04-21',
               '2000-05-19', '2000-06-16', '2000-07-21', '2000-08-18',
               '2000-09-15', '2000-10-20',
               ...
               '2011-11-18', '2011-12-16', '2012-01-20', '2012-02-17',
               '2012-03-16', '2012-04-20', '2012-05-18', '2012-06-15',
               '2012-07-20', '2012-08-17'],
              dtype='datetime64[ns]', length=152, freq='WOM-3FRI')

In [ ]:
from pandas.tseries.offsets import Day, MonthEnd
now = datetime(2011, 11, 17)
now + 3 * Day()

Timestamp('2011-11-20 00:00:00')

In [ ]:
offset = MonthEnd()
print(offset.rollforward(now))
offset.rollback(now)

2011-11-30 00:00:00

Timestamp('2011-10-31 00:00:00')

In [ ]:
ts = pd.Series(np.random.randn(20),
               index=pd.date_range('1/15/2000', periods=20, freq='4d'))
print(ts)

In [ ]:
# 과제
# Q. offset.rollforward 기준으로 그룹화를 진행 후 그룹별 평균값을 출력하세요.

In [ ]:
# 과제
# Q. 상기 문제를 resample을 사용하여 수행하세요.

In [ ]:
# 과제
# Q. 날짜 데이터를 인덱스로 하는 5가지 이상의 컬럼을 포함하고 있는 데이터 셋을 
# 생성하세요.단 각 컬럼은 인덱스별 의미있는 값을 갖도록 만든 후 다음을 수행하세요
# - 특정 연별, 월별, 일별 특정 컬럼 값 집계
# - 인덱스를 실수형으로 변환 후 다시 datetiem으로 변환
# - 인덱스의 포멧을 변환

In [ ]:
# Periods and Period Arithmetic
import pandas as pd
p = pd.Period(2007,freq='A-DEC')
p

Period('2007', 'A-DEC')

In [ ]:
print(p+5)

2012

In [ ]:
p-2

Period('2005', 'A-DEC')

In [ ]:
# 기간을 타임스탬프로 변환
import numpy as np
rng = pd.period_range('2000-01-01',periods=3, freq='M')
ts = pd.Series(np.random.randn(3),index=rng)
print(ts,'\n')
ts.to_timestamp(how='end')

2000-01   -0.009327
2000-02    1.503705
2000-03   -0.646172
Freq: M, dtype: float64

2000-01-31 23:59:59.999999999   -0.009327
2000-02-29 23:59:59.999999999    1.503705
2000-03-31 23:59:59.999999999   -0.646172
dtype: float64

In [ ]:
# Downsampling
rng = pd.date_range('2001-01-01',periods=12,freq='T')
ts = pd.Series(np.arange(12),index=rng)
ts

2001-01-01 00:00:00     0
2001-01-01 00:01:00     1
2001-01-01 00:02:00     2
2001-01-01 00:03:00     3
2001-01-01 00:04:00     4
2001-01-01 00:05:00     5
2001-01-01 00:06:00     6
2001-01-01 00:07:00     7
2001-01-01 00:08:00     8
2001-01-01 00:09:00     9
2001-01-01 00:10:00    10
2001-01-01 00:11:00    11
Freq: T, dtype: int32

In [ ]:
ts.resample('5min', closed='right').sum()

2000-12-31 23:55:00     0
2001-01-01 00:00:00    15
2001-01-01 00:05:00    40
2001-01-01 00:10:00    11
Freq: 5T, dtype: int32

In [ ]:
ts.resample('5min').ohlc()

                     open  high  low  close
2001-01-01 00:00:00     0     4    0      4
2001-01-01 00:05:00     5     9    5      9
2001-01-01 00:10:00    10    11   10     11

In [ ]:
frame = pd.DataFrame(np.random.randn(2,4),
                    index=pd.date_range('1/1/2000',periods=2,
                                       freq='W-WED'),
                    columns=['Colorado','Texas','New York','Ohio'])
frame

            Colorado     Texas  New York      Ohio
2000-01-05 -1.047179  2.017577 -0.334957 -0.149904
2000-01-12  0.337033 -1.041140 -1.719794 -1.763963

In [ ]:
df_daily = frame.resample('D').asfreq()
df_daily

            Colorado     Texas  New York      Ohio
2000-01-05 -1.047179  2.017577 -0.334957 -0.149904
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.337033 -1.041140 -1.719794 -1.763963

In [ ]:
frame.resample('D').ffill()

            Colorado     Texas  New York      Ohio
2000-01-05 -1.047179  2.017577 -0.334957 -0.149904
2000-01-06 -1.047179  2.017577 -0.334957 -0.149904
2000-01-07 -1.047179  2.017577 -0.334957 -0.149904
2000-01-08 -1.047179  2.017577 -0.334957 -0.149904
2000-01-09 -1.047179  2.017577 -0.334957 -0.149904
2000-01-10 -1.047179  2.017577 -0.334957 -0.149904
2000-01-11 -1.047179  2.017577 -0.334957 -0.149904
2000-01-12  0.337033 -1.041140 -1.719794 -1.763963

In [ ]:
frame.resample('D').ffill(limit=2)

            Colorado     Texas  New York      Ohio
2000-01-05 -1.047179  2.017577 -0.334957 -0.149904
2000-01-06 -1.047179  2.017577 -0.334957 -0.149904
2000-01-07 -1.047179  2.017577 -0.334957 -0.149904
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.337033 -1.041140 -1.719794 -1.763963